=== MODEL SETUP ===

preprocessing: True
classification: ternary
Twitter embeddings: False
Train set size: 50334
Test set size: 12284
Vocabulary size: 39905
earlystop | monitor: loss, min_delta: -0.01, patience: 2
epochs: 10
batch_size: 32
dropout: 0.5
====================

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
main_input (InputLayer)         (None, 67)           0                                            
__________________________________________________________________________________________________
el_mo_embedding_1 (ELMoEmbeddin (None, 67, 1024)     0           main_input[0][0]                 
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 66, 64)       131136      el_mo_embedding_1[0][0]          
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 65, 64)       196672      el_mo_embedding_1[0][0]          
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 63, 64)       327744      el_mo_embedding_1[0][0]          
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 33, 64)       0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 32, 64)       0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 31, 64)       0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2112)         0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 2048)         0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 1984)         0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 6144)         0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
                                                                 flatten_3[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 6144)         0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           307250      dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 3)            153         dense_1[0][0]                    
==================================================================================================
Total params: 962,955
Trainable params: 962,955
Non-trainable params: 0
__________________________________________________________________________________________________
              precision    recall  f1-score   support

    negative       0.60      0.34      0.43      3972
     neutral       0.57      0.67      0.62      5937
    positive       0.46      0.59      0.52      2375

   micro avg       0.55      0.55      0.55     12284
   macro avg       0.54      0.53      0.52     12284
weighted avg       0.56      0.55      0.54     12284

[[1336 2131  505]
 [ 776 4007 1154]
 [ 123  845 1407]]
